read_liberty /home/gmsarath/Sarath/vlsi_wrk/OpenROAD/test/Nangate45/Nangate45_typ.lib
read_verilog /home/gmsarath/Sarath/vlsi_wrk/sta_exercise/sta_check_examples/multicycle_example/my_ckt_synthesized.v
link_design my_ckt
read_sdc constraints.sdc

